'''Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый 
ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
6 -> 1 4 1
24 -> 4 16 4
60 -> 10 40 10'''
a = int(input("Введите сколько сделал журавликов Петя: "))
b = a 
print("Тогда Сережа сделал тоже: " + str(b) , "журавликов" )
c = a*2 
print("А Катя сделала: " + str(c) , "журавликов")
rez = a + b + c
print("Вместе они сделали: " + str(rez) , "журавликов" )