#Задача 2: Найдите сумму цифр трехзначного числа.
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0)

a = int(input('Введите трехзначное число:'))
b = 0
while a > 0:
   b= b + a % 10
   a = a // 10
print('Сумма чисел равняется: ' + str(b))
